# Pandas

In [1]:
""""
pip install pandas   ------> to install pandas in vs code
import pandas as pd  (importing pandas and giving "pd" as alias name)

Panda is a python library used for manipulation and analysis.
It has 2 data structure:-
1)Series
2)Data frame

"""

'"\npip install pandas   ------> to install pandas in vs code\nimport pandas as pd  (importing pandas and giving "pd" as alias name)\n\nPanda is a python library used for manipulation and analysis.\nIt has 2 data structure:-\n1)Series\n2)Data frame\n\n'

In [2]:
import pandas as pd
import numpy as np

### 1)Series

In [3]:
# creating a series

ser = pd.Series() 
print("Pandas Series: ", ser,'\n') 

data = np.array(['g', 'e', 'e', 'k', 's']) 
  
ser = pd.Series(data) 
print("Pandas Series:\n", ser)

Pandas Series:  Series([], dtype: object)

Pandas Series:
 0    g
1    e
2    e
3    k
4    s
dtype: object

In [4]:
s1=pd.Series([10,20,30,40,'hello',[1,2,4]])
print(s1)
print("***************************************************************************************************")
print(type(s1))
print("***************************************************************************************************")

s1[4]='hi'
s2=pd.Series([1,2,3,4,'world',[9]])
print(s1+s2)
print("***************************************************************************************************")
print(s1)
print("***************************************************************************************************")
print(s2)
print("***************************************************************************************************")
print(s1[4])

0           10
1           20
2           30
3           40
4        hello
5    [1, 2, 4]
dtype: object
***************************************************************************************************
<class 'pandas.core.series.Series'>
***************************************************************************************************
0              11
1              22
2              33
3              44
4         hiworld
5    [1, 2, 4, 9]
dtype: object
***************************************************************************************************
0           10
1           20
2           30
3           40
4           hi
5    [1, 2, 4]
dtype: object
***************************************************************************************************
0        1
1        2
2        3
3        4
4    world
5      [9]
dtype: object
***************************************************************************************************
hi

In [5]:
s3=pd.Series([1,2,3,4,5,6,7,8,9],name="marks")
print(s3)
s4=s3[3:8:2]
print(s4)

0    1
1    2
2    3
3    4
4    5
5    6
6    7
7    8
8    9
Name: marks, dtype: int64
3    4
5    6
7    8
Name: marks, dtype: int64

### 2)Data frame

In [6]:
df=pd.DataFrame({"Name":['Yami','Deepa',],
                 "Marks":[69,96],
                 "Rollno":[76,129]})

df

    Name  Marks  Rollno
0   Yami     69      76
1  Deepa     96     129

In [7]:
# DATA FRAMES

df1=pd.DataFrame({"Name":['Yami','Deepa','Yamini','Deepika','Deeya'],
                 "Ratings":['1*','1','2*','2','1*'],
                 "Qualification":['MCA','MCA','BCA','BCA','B.Tech']})

df1

      Name Ratings Qualification
0     Yami      1*           MCA
1    Deepa       1           MCA
2   Yamini      2*           BCA
3  Deepika       2           BCA
4    Deeya      1*        B.Tech

In [ ]:
"""
pd.read_csv is used to read the file in this we read file that is in same folder

"""

d1=pd.read_csv('flipkart_sales.csv')
print(d1,'\n')
d1['Product Name']

     Order ID      Product Name        Category  Price (INR)  Quantity Sold  \
0    ORD00001  Educational Book           Books     49069.56              2
1    ORD00002             Jeans        Clothing     12755.85              4
2    ORD00003        Face Cream          Beauty     11092.19              4
3    ORD00004        Smartwatch     Electronics     32657.81              1
4    ORD00005      Cookware Set  Home & Kitchen     26590.08              3
..        ...               ...             ...          ...            ...
995  ORD00996        Smartphone     Electronics     28995.81              3
996  ORD00997           Perfume          Beauty     32799.51              2
997  ORD00998        Face Cream          Beauty     40840.80              1
998  ORD00999      Cookware Set  Home & Kitchen     34741.79              4
999  ORD01000        Table Lamp  Home & Kitchen     16698.12              4

     Total Sales (INR)  Order Date Payment Method  Customer Rating
0             98139.12  2024-09-12     Debit Card              3.5
1             51023.40  2024-12-18            UPI              3.9
2             44368.76  2024-05-18     Debit Card              4.4
3             32657.81  2024-11-08     Debit Card              3.2
4             79770.24  2024-12-27            UPI              3.1
..                 ...         ...            ...              ...
995           86987.43  2025-01-13            COD              5.0
996           65599.02  2024-12-18         Wallet              2.4
997           40840.80  2024-07-26            UPI              3.1
998          138967.16  2024-10-02    Net Banking              3.2
999           66792.48  2024-03-26    Credit Card              1.6

[1000 rows x 9 columns]

0      Educational Book
1                 Jeans
2            Face Cream
3            Smartwatch
4          Cookware Set
             ...
995          Smartphone
996             Perfume
997          Face Cream
998        Cookware Set
999          Table Lamp
Name: Product Name, Length: 1000, dtype: object

In [ ]:
# here we read a file from a link of github
d2=pd.read_csv('https://raw.githubusercontent.com/whoknowayush/DataAnalysis-Dataset/refs/heads/main/Datasets-Practice/hr_data.csv')
print(d2)

       employee_id  number_project  average_montly_hours  time_spend_company  \
0             1003               2                   157                   3
1             1005               5                   262                   6
2             1486               7                   272                   4
3             1038               5                   223                   5
4             1057               2                   159                   3
...            ...             ...                   ...                 ...
14994        87670               2                   151                   3
14995        87673               2                   160                   3
14996        87679               2                   143                   3
14997        87681               6                   280                   4
14998        87684               2                   158                   3

       Work_accident  left  promotion_last_5years department  salary
0                  0     1                      0      sales     low
1                  0     1                      0      sales  medium
2                  0     1                      0      sales  medium
3                  0     1                      0      sales     low
4                  0     1                      0      sales     low
...              ...   ...                    ...        ...     ...
14994              0     1                      0    support     low
14995              0     1                      0    support     low
14996              0     1                      0    support     low
14997              0     1                      0    support     low
14998              0     1                      0    support     low

[14999 rows x 9 columns]

In [11]:
# its a 2-D and consistsof row& series
# syntax :- pd.DataFrame(dictionaty)

# Creating a dictionary
data1 = {
    "emp_name": ["Rahul", "Priya", "Aman", "Sneha", "Karan", "Meera", "Vikas", "Anita", "Rohit", "Tina"],
    "emp_loc": ["Delhi", "Mumbai", "Bangalore", "Chennai", "Pune", "Hyderabad", "Kolkata", "Jaipur", "Surat", "Noida"],
    "emp_sal": [45000, 52000, 48000, 50000, 47000, 55000, 53000, 46000, 60000, 49000],
    "emp_designation": ["Developer", "Analyst", "Tester", "Manager", "Designer", "HR", "Developer", "Analyst", "Manager", "Tester"],
    "emp_id": [101, 102, 103, 104, 105, 106, 107, 108, 109, 110]
}

# Creating DataFrame
emp_df = pd.DataFrame(data1)
print(emp_df)

  emp_name    emp_loc  emp_sal emp_designation  emp_id
0    Rahul      Delhi    45000       Developer     101
1    Priya     Mumbai    52000         Analyst     102
2     Aman  Bangalore    48000          Tester     103
3    Sneha    Chennai    50000         Manager     104
4    Karan       Pune    47000        Designer     105
5    Meera  Hyderabad    55000              HR     106
6    Vikas    Kolkata    53000       Developer     107
7    Anita     Jaipur    46000         Analyst     108
8    Rohit      Surat    60000         Manager     109
9     Tina      Noida    49000          Tester     110